Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2025DAS169.PIC
      <edc:SFRDef edc:_addr="0x1F84B03C" edc:_begin="0x20" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B040" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMPEN2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE19" edc:mask="0x1" edc:name="CMPE19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE20" edc:mask="0x1" edc:name="CMPE20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE21" edc:mask="0x1" edc:name="CMPE21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE22" edc:mask="0x1" edc:name="CMPE22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE23" edc:mask="0x1" edc:name="CMPE23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE24" edc:mask="0x1" edc:name="CMPE24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE25" edc:mask="0x1" edc:name="CMPE25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE26" edc:mask="0x1" edc:name="CMPE26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE27" edc:mask="0x1" edc:name="CMPE27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE28" edc:mask="0x1" edc:name="CMPE28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE29" edc:mask="0x1" edc:name="CMPE29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE30" edc:mask="0x1" edc:name="CMPE30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE31" edc:mask="0x1" edc:name="CMPE31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B044" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B048" edc:_begin="0x38" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMPEN3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE19" edc:mask="0x1" edc:name="CMPE19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE20" edc:mask="0x1" edc:name="CMPE20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE21" edc:mask="0x1" edc:name="CMPE21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE22" edc:mask="0x1" edc:name="CMPE22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE23" edc:mask="0x1" edc:name="CMPE23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE24" edc:mask="0x1" edc:name="CMPE24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE25" edc:mask="0x1" edc:name="CMPE25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE26" edc:mask="0x1" edc:name="CMPE26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE27" edc:mask="0x1" edc:name="CMPE27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE28" edc:mask="0x1" edc:name="CMPE28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE29" edc:mask="0x1" edc:name="CMPE29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE30" edc:mask="0x1" edc:name="CMPE30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE31" edc:mask="0x1" edc:name="CMPE31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
