Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2025DAS169.PIC
      <edc:AdjustPoint edc:_addr="0x1F84B620" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F84B640" edc:_begin="0xc0" edc:_end="0xc8" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="30" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCSYSCFG0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCSYSCFG0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AN0" edc:mask="0x1" edc:name="AN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN1" edc:mask="0x1" edc:name="AN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN2" edc:mask="0x1" edc:name="AN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN3" edc:mask="0x1" edc:name="AN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN4" edc:mask="0x1" edc:name="AN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN5" edc:mask="0x1" edc:name="AN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN6" edc:mask="0x1" edc:name="AN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN7" edc:mask="0x1" edc:name="AN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN8" edc:mask="0x1" edc:name="AN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN9" edc:mask="0x1" edc:name="AN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN10" edc:mask="0x1" edc:name="AN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN11" edc:mask="0x1" edc:name="AN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN12" edc:mask="0x1" edc:name="AN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN13" edc:mask="0x1" edc:name="AN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN14" edc:mask="0x1" edc:name="AN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN15" edc:mask="0x1" edc:name="AN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN16" edc:mask="0x1" edc:name="AN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN17" edc:mask="0x1" edc:name="AN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN18" edc:mask="0x1" edc:name="AN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN19" edc:mask="0x1" edc:name="AN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN20" edc:mask="0x1" edc:name="AN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN21" edc:mask="0x1" edc:name="AN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN22" edc:mask="0x1" edc:name="AN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN23" edc:mask="0x1" edc:name="AN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN24" edc:mask="0x1" edc:name="AN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN25" edc:mask="0x1" edc:name="AN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN26" edc:mask="0x1" edc:name="AN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN27" edc:mask="0x1" edc:name="AN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN28" edc:mask="0x1" edc:name="AN28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN29" edc:mask="0x1" edc:name="AN29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN30" edc:mask="0x1" edc:name="AN30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN31" edc:mask="0x1" edc:name="AN31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B644" edc:_begin="0xc0" edc:_end="0xc8" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="30" edc:access="--------------------rrrrrrrrrrrr" edc:cname="ADCSYSCFG1" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="ADCSYSCFG1" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AN32" edc:mask="0x1" edc:name="AN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN33" edc:mask="0x1" edc:name="AN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN34" edc:mask="0x1" edc:name="AN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN35" edc:mask="0x1" edc:name="AN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN36" edc:mask="0x1" edc:name="AN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN37" edc:mask="0x1" edc:name="AN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN38" edc:mask="0x1" edc:name="AN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN39" edc:mask="0x1" edc:name="AN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN40" edc:mask="0x1" edc:name="AN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN41" edc:mask="0x1" edc:name="AN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN42" edc:mask="0x1" edc:name="AN42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN43" edc:mask="0x1" edc:name="AN43" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
